print('================================================================')
print('=======================    Bubble Sort    ======================')
print('================================================================')
print('================================================================ \n')

print('Hi there, user!')
start='''Το σύστημα θα κατασκευάσει μια λίστα L με μήκος όσο ο ακέραιος
που θα εισάγει ο χρήστης. Οι τιμές που θα λάβει η λίστα θα είναι
τυχαίοι ακέραιοι αριθμοί απο το 1 έως και το 100. \n'''
print(start)

import random as rn
num=int(input('Εισάγετε Ακέραιο Αριθμό: '))

#Κατασκευή λίστας με περιγραφή
L=[rn.randint(1,100) for k in range(num)]

#Ταξινόμηση φυσαλίδας
for i in range(num-1):
    for j in range(num-1-i):
        if L[j+1]<L[j]:
            temp= L[j]
            L[j]=L[j+1]
            L[j+1]= temp
print('==============================================\n\
Η λίστα που κατασκευάστηκε είναι η L:\n',L,'\
\n===============================================')

end='''\n================================================================\n\
============ Τέλος ταξινόμησης. Χρήστη σε Χαιρετώ!! ============\n\
================================================================'''
print(end)

