print('========================================================================')
print('============================== Scrabble ================================')
print('========================  Points Calculator  ===========================')
print('======================= power by Christos Millas =======================')
print('======================================================================== \n')

print('Hi there, user!')

start='''Ο χρήστης εισάγει την λέξη ΧΩΡΙΣ τόνους στα ελληνικά με κεφαλαία γράμματα
(αν και προβλέπεται από το σύστημα). Το σύστημα θα του επιστρέψει τον
αριθμό των πόντων που κερδίζει. Με την εντολή q ο χρήστης αποχωρεί.'''
print(start)

alphabet={('Α', 'Ε', 'Η', 'Ι', 'Ν', 'Ο', 'Σ', 'Τ'):1,
          ('Κ', 'Π', 'Ρ', 'Υ'):2,
          ('Λ', 'Μ', 'Ω'):3,
          ('Γ', 'Δ'):4,
          ('Β', 'Φ', 'Χ'):8,
          ('Ζ', 'Θ', 'Ξ', 'Ψ'):10}

while True:
    word=str(input('\nΓράψε την λέξη με Ελληνικά γράμματα (q για έξοδο): '))
    word=word.upper()
    score = []           
    if word=='Q':
        break
    else:
        for character in word:
            if character in ['Α', 'Ε', 'Η', 'Ι', 'Ν', 'Ο', 'Σ', 'Τ']:
                number=alphabet['Α', 'Ε', 'Η', 'Ι', 'Ν', 'Ο', 'Σ', 'Τ']
                score.append(number)
            elif character in ['Κ', 'Π', 'Ρ', 'Υ']:
                number=alphabet['Κ', 'Π', 'Ρ', 'Υ']
                score.append(number)
            elif character in ['Λ', 'Μ', 'Ω']:
                number=alphabet['Λ', 'Μ', 'Ω']
                score.append(number)
            elif character in ['Γ', 'Δ']:
                number=alphabet['Γ', 'Δ']
                score.append(number)
            elif character in ['Β', 'Φ', 'Χ']:
                number=alphabet['Β', 'Φ', 'Χ']
                score.append(number)
            elif character in ['Ζ', 'Θ', 'Ξ', 'Ψ']:
                number=alphabet['Ζ', 'Θ', 'Ξ', 'Ψ']
                score.append(number)
        print(sum(score))

        
end='''\n==========================================================================\n\
================== Τέλος Παιχνιδιού! Χρήστη σε Χαιρετώ!! =================\n\
=========================================================================='''
print(end)



